//: C03/AutoIncrement.cpp
// Использования операторов инкремента и декремента.
#include <iostream>

int main() {
    int i = 5;
    int j = 5;

    std::cout << "i   => " << i << ", j   => " << j << std::endl;
    std::cout << "++i => " << ++i << ", --j => " << --j << '\n'; // Префиксное увеличение Префиксное уменьшение
    std::cout << "i   => " << i << ", j   => " << j << std::endl;
    std::cout << "i++ => " << i++ << ", j-- => " << j-- << '\n'; // Постфиксное увеличение Постфиксное уменьшение
    std::cout << "i   => " << i << ", j   => " << j << '\n';
    return 0;
}
